<a href="https://colab.research.google.com/github/brendanpshea/database_sql/blob/main/labs/Database_Lab_Chapter_3.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# SQL Practice (Chapter 3)
Before starting to write queries, please run the following two cells.

In [ ]:
!pip install prettytable==0.7.2 --force-reinstall -q
%reload_ext sql
%sql sqlite://

In [ ]:
%%sql
-- Drop tables if they exist
DROP TABLE IF EXISTS rentals;
DROP TABLE IF EXISTS videos;
DROP TABLE IF EXISTS patrons;

-- Create patrons table
CREATE TABLE patrons (
    patron_id INTEGER PRIMARY KEY,
    first_name VARCHAR(50) NOT NULL,
    last_name VARCHAR(50) NOT NULL,
    email VARCHAR(100) UNIQUE NOT NULL,
    join_date DATE NOT NULL,
    membership_level VARCHAR(20) CHECK (membership_level IN ('Bronze', 'Silver', 'Gold'))
);

-- Create videos table
CREATE TABLE videos (
    video_id INTEGER PRIMARY KEY,
    title VARCHAR(100) NOT NULL,
    genre VARCHAR(50) NOT NULL,
    release_year INTEGER NOT NULL,
    rental_price DECIMAL(4,2) NOT NULL,
    total_copies INTEGER NOT NULL,
    available_copies INTEGER NOT NULL,
    CHECK (available_copies <= total_copies)
);

-- Create rentals table
CREATE TABLE rentals (
    rental_id INTEGER PRIMARY KEY,
    patron_id INTEGER REFERENCES patrons(patron_id),
    video_id INTEGER REFERENCES videos(video_id),
    checkout_date DATE NOT NULL,
    due_date DATE NOT NULL,
    return_date DATE,
    late_fee DECIMAL(4,2) DEFAULT 0.00,
    CHECK (return_date >= checkout_date OR return_date IS NULL),
    CHECK (due_date > checkout_date)
);

-- Insert patron data
INSERT INTO patrons VALUES
    (1, 'Sarah', 'Johnson', 'sarah.j@email.com', '2023-01-15', 'Gold'),
    (2, 'Michael', 'Chen', 'mchen@email.com', '2023-02-01', 'Silver'),
    (3, 'Emma', 'Williams', 'ewilliams@email.com', '2023-03-10', 'Bronze'),
    (4, 'James', 'Martinez', 'jmartinez@email.com', '2023-02-28', 'Gold'),
    (5, 'Lisa', 'Anderson', 'landerson@email.com', '2023-04-05', 'Silver'),
    (6, 'David', 'Brown', 'dbrown@email.com', '2023-04-10', 'Bronze');

-- Insert video data
INSERT INTO videos VALUES
    (1, 'The Matrix', 'Science Fiction', 1999, 3.99, 3, 2),
    (2, 'Jurassic Park', 'Adventure', 1993, 3.99, 4, 3),
    (3, 'The Shawshank Redemption', 'Drama', 1994, 2.99, 2, 1),
    (4, 'Toy Story', 'Animation', 1995, 2.99, 3, 3),
    (5, 'The Godfather', 'Drama', 1972, 3.99, 2, 1),
    (6, 'Pulp Fiction', 'Drama', 1994, 3.99, 2, 2),
    (7, 'Finding Nemo', 'Animation', 2003, 2.99, 3, 3);

-- Insert rental data
INSERT INTO rentals VALUES
    (1, 1, 1, '2024-01-15', '2024-01-18', '2024-01-17', 0.00),
    (2, 2, 3, '2024-01-16', '2024-01-19', '2024-01-20', 2.00),
    (3, 4, 2, '2024-01-17', '2024-01-20', NULL, 0.00),
    (4, 3, 5, '2024-01-15', '2024-01-18', '2024-01-18', 0.00),
    (5, 5, 1, '2024-01-18', '2024-01-21', NULL, 0.00);

 * sqlite://
Done.
Done.
Done.
Done.
Done.
Done.
6 rows affected.
7 rows affected.
5 rows affected.

[]

## Overview of the Data

In [ ]:
%%sql
SELECT * FROM patrons;

 * sqlite://
Done.

[(1, 'Sarah', 'Johnson', 'sarah.j@email.com', '2023-01-15', 'Gold'),
 (2, 'Michael', 'Chen', 'mchen@email.com', '2023-02-01', 'Silver'),
 (3, 'Emma', 'Williams', 'ewilliams@email.com', '2023-03-10', 'Bronze'),
 (4, 'James', 'Martinez', 'jmartinez@email.com', '2023-02-28', 'Gold'),
 (5, 'Lisa', 'Anderson', 'landerson@email.com', '2023-04-05', 'Silver'),
 (6, 'David', 'Brown', 'dbrown@email.com', '2023-04-10', 'Bronze')]

In [ ]:
%%sql
SELECT * FROM videos;

 * sqlite://
Done.

[(1, 'The Matrix', 'Science Fiction', 1999, 3.99, 3, 2),
 (2, 'Jurassic Park', 'Adventure', 1993, 3.99, 4, 3),
 (3, 'The Shawshank Redemption', 'Drama', 1994, 2.99, 2, 1),
 (4, 'Toy Story', 'Animation', 1995, 2.99, 3, 3),
 (5, 'The Godfather', 'Drama', 1972, 3.99, 2, 1),
 (6, 'Pulp Fiction', 'Drama', 1994, 3.99, 2, 2),
 (7, 'Finding Nemo', 'Animation', 2003, 2.99, 3, 3)]

In [ ]:
%%sql
SELECT * FROM rentals;

 * sqlite://
Done.

[(1, 1, 1, '2024-01-15', '2024-01-18', '2024-01-17', 0),
 (2, 2, 3, '2024-01-16', '2024-01-19', '2024-01-20', 2),
 (3, 4, 2, '2024-01-17', '2024-01-20', None, 0),
 (4, 3, 5, '2024-01-15', '2024-01-18', '2024-01-18', 0),
 (5, 5, 1, '2024-01-18', '2024-01-21', None, 0)]

## Questions
Please write queries to answer the following questions. You can use the code cells below.

1.	Find all videos that cost $3.99 to rent.

2.	Find all patrons whose last name starts with the letter 'W'.


3.	Find all rentals where the video hasn't been returned yet.

4.	Find all videos released after 1995.


5.	Find all videos that are either Drama genre OR cost less than $3.50 to rent.

6.	Count how many Gold membership patrons we have.


7.	Find the oldest and newest release years.

8.	Find all videos that are either:  (a) drama genre with more than 1 copy availabl OR (b) any genre with rental price less than $3.00

9.	Find all patrons who are not Silver members.

10.	Calculate the average rental price of all videos.


11.	Display the title of each rented video along with the first and last name of the patron who rented it. Only include videos that are currently rented out (where return_date is NULL).


12.	Show all patrons and any videos they currently have checked out. Include patrons who have no current rentals.

13.	Display all videos and their current rental status. Include the patron's name if the video is currently rented out. Show all videos, even those not currently rented.

14.	Create a list of all patron names (first and last) who are either Gold members OR have rented a Drama movie. Use UNION to combine these two groups.

15.	Find patrons who are both Gold members AND have rented a movie with a rental price over $3.50. Use INTERSECT to find this overlap.


16.	CHALLENGE: Show all possible combinations of videos and membership levels by using a CROSS JOIN. Display the video title, rental price, and membership level.

In [ ]:
%%sql
-- problem 1

In [ ]:
%%sql
-- problem 2

In [ ]:
%%sql
-- problem 3

In [ ]:
%%sql
-- problem 4

In [ ]:
%%sql
-- problem 5

In [ ]:
%%sql
-- problem 6

In [ ]:
%%sql
-- problem 7

In [ ]:
%%sql
-- problem 8

In [ ]:
%%sql
-- problem 9

In [ ]:
%%sql
-- problem 10

In [ ]:
%%sql
-- problem 11

In [ ]:
%%sql
-- problem 12

In [ ]:
%%sql
-- problem 13

In [ ]:
%%sql
-- problem 14

In [ ]:
%%sql
-- problem 15

In [ ]:
%%sql
-- problem 16